import { Dictionaries } from '../models/dictionaries';

export const DICTIONARIES: Dictionaries[] = [
  {
    name: 'ハラスメントとは?',
    children: [
      {id: '00', name: '定義'},
      {id: '01', name: '歴史'},
      {id: '02', name: '法律'},
      {id: '03', name: '実態'},
      {id: '04', name: '人間の尊厳'}
    ]
  },
  {
    name: '関連団体',
    children: [
      {id: '01', name: '厚生労働省'},
      {id: '02', name: '内閣府男女共同参画局'},
      {id: '03', name: '法務省'},
      {id: '04', name: '一般社団法人日本ハラスメント協会'},
      {id: '05', name: '一般財団法人日本ハラスメントカウンセラー協会'},
      {id: '06', name: '一般社団法人日本産業カウンセラー協会JAICO'},
      {id: '07', name: 'NPO NAAH'},
    ]
  },
  {
    name: '上下関係',
    children: [
      {name: 'アルコールハラスメント'},
      {name: 'お菓子ハラスメント'},
      {name: '終われハラスメント'},
      {name: '時短ハラスメント'},
      {name: 'テクノロジーハラスメント'},
      {name: 'パワーハラスメント'},
      {name: 'リストラハラスメント'},
      {name: 'パタニティハラスメント'},
      {name: 'アカデミックハラスメント'},
      {name: 'ドクターハラスメント'},
      {name: 'ハラスメントハラスメント'},
      {name: 'カスタマーハラスメント'},
      {name: 'グルメハラスメント'},
    ]
  },
  {
    name: '性・恋愛',
    children: [
      {name: 'ジェンダーハラスメント'},
      {name: 'セクシャルハラスメント'},
      {name: 'テクスチュアルハラスメント'},
      {name: 'マリッジハラスメント'},
      {name: 'ラブハラスメント'},
      {name: 'スクールセクシャルハラスメント'},
      {name: 'ゼクシャルハラスメント'},
      {name: '告白ハラスメント'},
      {name: '家事ハラスメント'},
    ]
  },
  {
    name: '身体',
    children: [
      {name: 'エアコンハラスメント'},
      {name: 'スメルハラスメント'},
      {name: 'スモークハラスメント'},
      {name: 'カラオケハラスメント'},
      {name: 'ブラッドタイプハラスメント'},
      {name: 'エレクトロニックハラスメント'},
    ]
  },
  {
    name: '心',
    children: [
      {name: 'ヌードルハラスメント'},
      {name: 'エンジョイハラスメント'},
      {name: 'マタニティハラスメント'},
      {name: 'レイシャルハラスメント'},
      {name: 'レリジャスハラスメント'},
      {name: 'エアーハラスメント'},
      {name: 'エイジハラスメント'},
      {name: 'コミュニケーションハラスメント'},
      {name: 'セカンドハラスメント'},
      {name: 'ソーシャルハラスメント'},
      {name: 'パーソナルハラスメント'},
      {name: 'フォトハラスメント'},
      {name: 'モラルハラスメント'},
      {name: 'ペットハラスメント'},
      {name: '新型パワーハラスメント'},
      {name: '妊活ハラスメント'},
      {name: '2人目ハラスメント'},
      {name: 'ソジハラスメント'},
    ]
  }
];
